#include <iostream>
#include <windows.h>
using namespace std;

int main ()
{
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);

    double x,y;
    cout << "Введите х координату:" << "\n"; cin >> x;
    cout << "Введите y координату:" << "\n"; cin >> y;

    // нижний квадрат + верхний квадрат + верхняя хрень слева + нижняя хрень справа
    if ((x >= -3 && x <= 0 && y >= -3 && y <= 0) || (x <= 3 && x >= 0 && y <= 3 && y >= 0) || 
    (x*x + y*y >= 4 &&  x*x + y*y <= 9 && x >= -3 && x <= 0 && y >= 0 && y <= 3) || 
    (x*x + y*y >= 4 &&  x*x + y*y <= 9 && x >= 0 && x <= 3 && y >= -3 && y <= 0))
    {
        cout << "Координата (" << x << ";" << y << ") пренадлежит выделенному участку" << "\n";
    }

    else 
    {
        cout << "Координата (" << x << ";" << y << ") не пренадлежит выделенному участку" << "\n";
    }

    return 0;   
}